#Задание 15 (№31512).
# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m»;
# пусть на числовой прямой дан отрезок B = [70; 90].
# Для какого наибольшего натурального числа A логическое выражение
#ДЕЛ(x, A) ∨ ((x ∈ B) → ¬ДЕЛ(x, 22))
#истинно (т.е. принимает значение 1) при любом целом положительном значении переменной x?


for a in range(1000, 0, -1):
    if all((x % a == 0) or ((70 <= x <= 90) <= (x % 22 != 0)) for x in range(1, 5000)):
        print(a)
        break