#Камера делает снимки размером 1280 × 960 пикселей с палитрой 4096 цветов.
# Снимки группируются в пакеты по 80 штук. Каждый снимок сжимается,
# после чего к пакету добавляется служебная информация объёмом 3000 Кбайт (она не сжимается).
# Пакеты отправляются по каналу с пропускной способностью 4800 Кбайт/с,
# и передача одного пакета должна занимать не более 25 секунд.

#Определите наименьшее целое число процентов, на которое нужно сжать каждый снимок,
# чтобы это условие выполнялось. В ответе запишите только число.

k = 1280 * 960
j = 12
n = 80
i1 = k * j / 8 / 1024
#I = (i1 * X) + 3000
i2 = 4800 * 25

#I = i2
i3 = i2 - 3000
#i3 = (i1 * X)
N = i3 / i1

res = (1 - (N/n)) * 100
print(res)
#Округляем вверх = 19
#Проверка
print(f'Проверка:{80*1800*((100-19)/100) + 3000} =< 120 000')