#Задание 14 (№17870).
# Значение арифметического выражения 7¹⁷⁰ + 7¹⁰⁰ − x, где x – целое положительное число,
# не превышающее 2030, записали в 7-ричной системе счисления. Определите наибольшее значение x,
# при котором в 7-ричной записи числа, являющегося значением данного арифметического выражения,
# содержится ровно 71 нуль. В ответе запишите число в десятичной системе счисления.

for a in range(2030, 0, -1):
    x = 7 ** 170 + 7 ** 100 - a
    s = 0
    while x > 0:
        if x % 7 == 0:
            s += 1
        x = x // 7
    if s == 71:
        print(a)
        break