#Андрей составляет 5-буквенные коды из букв А, Н, Д, Р, Е, Й. Буквы А и Й
# нужно обязательно использовать ровно по одному разу, букву Д можно использовать один раз
# или не использовать совсем, а буквы Н, Р, Е можно
# использовать произвольное количество раз или не использовать вовсе.
#Сколько различных кодов может составить Андрей?

from itertools import product

count = 0
for s in product('АНДРЕЙ', repeat=5):
    line = ''.join(s)
    if line.count('А') == 1 and line.count('Й') == 1 and line.count('Д') < 2:
        count += 1
print(count)