#В информационной системе хранится информация об объектах. Каждый объект описывается как последовательность блоков.
# Для каждого блока указываются его код и тип. Код блока состоит из 5 символов,
# каждый из которых может быть заглавной латинской буквой или цифрой. Каждый символ кода кодируется минимально возможным количеством бит.
# Тип блока это целое число от 1 до N, которое кодируется минимально возможным количеством бит.
# Блок в целом кодируется минимально возможным целым количеством байт.
#Для хранения информации о каждом объекте выделяется одинаковое для всех объектов минимальное количество байт,
# достаточное для описания 30 блоков.
#Известно, что для хранения данных о 1024 объектах потребовалось 150 Кбайт.

#a) Определите максимально возможное значение N.
#б) Определите минимально возможное значение N.

c = 1024
I = 150 * 1024 / 1024 #bajt

l = 5
alphabet = 26 + 10
j = 6
bats = 6 * 5
I = I / 30
blok = I * 8
res = blok - 30
print(res)
print(2**res)