#Исполнитель преобразует число на экране.
#У исполнителя есть две команды, которые обозначены латинскими буквами:
#A. Прибавь 1
#B. Поменяй местами
#Первая из этих команд увеличивает число на экране на 1. Вторая команда применяется только к числу,
#у которого цифра в разряде десятков по значению меньше цифры, стоящей в разряде единиц, и действует,
#заменяя число на экране числом, в котором цифры двух младших разрядов поменялись местами.
#Программа для исполнителя — это последовательность команд.
#Сколько существует программ, для которых при исходном числе 100 результатом является число 141?
#Траектория вычислений программы — это последовательность результатов выполнения всех команд программы.
#Например, для программы ABA при исходном числе 13 траектория состоит из чисел 14, 41, 42.


def f(x, y):
    if x == y:
        return 1
    if x > y:
        return 0
    s = f(x + 1, y)
    t, u = x // 10 % 10, x % 10
    if t < u:
        st = str(x)
        new = int(st[:-2] + st[-1] + st[-2])
        s += f(new, y)
    return s

print(f(100, 141))
#16